tutorials/turbine/KrogstadWindTunnelCase/system/controlDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       pisoFoamTurbine;

libs              ("libuserincompressibleLESModels.so");

startFrom         startTime;

startTime         0;

stopAt            endTime;

endTime           10.0; 

deltaT            0.0005;

writeControl      adjustableRunTime;

writeInterval     0.5;

purgeWrite        0;

writeFormat       binary;

writePrecision    12;

writeCompression  compressed;

timeFormat        general;

timePrecision     12;

runTimeModifiable no;

adjustTimeStep    no;

maxCo             0.5;

maxDeltaT         0.01;

startTimeMean     2.0;

startTimeCorr     4.0;


functions
{
  
// #include "testSample"
   
}


// ************************************************************************* //
