tutorials/turbine/KrogstadWindTunnelCase/constant/airfoilProperties/NREL_S826_RE100k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//   alpha   C_l    C_d

//OLD stuff
(	-180	0.06071417	0.144935804	)
(	-175	0.683149354	0.223494484	)
(	-170	0.928282469	0.347798399	)
(	-165	0.876270897	0.474706056	)
(	-160	0.86638623	0.625519981	)
(	-155	0.932875429	0.801019306	)
(	-150	0.965101832	0.968482989	)
(	-145	1.065080328	1.223262604	)
(	-140	1.033453269	1.380786017	)
(	-135	0.99045269	1.550840714	)
(	-130	1.010102237	1.8461881	)
(	-125	0.921449778	2.014625072	)
(	-120	0.876373732	2.3099946	)
(	-115	0.70719892	2.381675796	)
(	-110	0.579517763	2.571831823	)
(	-105	0.462316413	2.944685439	)
(	-100	0.218925014	2.712260366	)
(	-95	0.027345624	2.653372613	)
(	-90	-0.157828368	2.651386307	)
(	-85	-0.332434523	2.621073481	)
(	-80	-0.518367271	2.659001736	)
(	-75	-0.684962546	2.576263452	)
(	-70	-0.832539981	2.449826422	)
(	-65	-0.949149778	2.288297396	)
(	-60	-1.106781022	2.291931148	)
(	-55	-1.089470183	1.913289952	)

//New values RE = 100000
(	-50	-0.5618	0.42319	)
(	-45	-0.5746	0.40718	)
(	-40	-0.572	0.38815	)
(	-35	-0.6866	0.35	)
(	-30	-0.6599	0.33	)
(	-25	-0.5898	0.30821	)
(	-24	-0.5726	0.29418	)
(	-23	-0.5534	0.27929	)
(	-22	-0.5328	0.26429	)
(	-21	-0.5108	0.24899	)
(	-20	-0.4869	0.2325	)
(	-19	-0.465	0.21918	)
(	-18	-0.4435	0.20707	)
(	-17	-0.4227	0.19561	)
(	-16	-0.4033	0.1844	)
(	-15	-0.3862	0.17229	)
(	-14	-0.3716	0.15988	)
(	-13	-0.3614	0.14682	)
(	-12	-0.3545	0.13377	)
(	-11	-0.3544	0.11993	)
(	-10	-0.359	0.10421	)
(	-9	-0.3454	0.07913	)
(	-8	-0.3803	0.05544	)
(	-7	-0.3389	0.0375	)
(	-6	-0.2304	0.02759	)
(	-5	-0.1071	0.02228	)
(	-4	0.0529	0.01814	)
(	-3	0.2064	0.01681	)
(	-2	0.332	0.01685	)
(	-1	0.4576	0.01667	)
(	0	0.5807	0.01673	)
(	1	0.6963	0.01702	)
(	2	0.8117	0.01747	)
(	3	0.9198	0.01811	)
(	4	1.03	0.01889	)
(	5	1.1287	0.01977	)
(	6	1.2182	0.02068	)
(	7	1.287	0.0223	)
(	8	1.3027	0.02686	)
(	9	1.3239	0.03235	)
(	10	1.3416	0.03886	)
(	11	1.3543	0.04642	)
(	12	1.3584	0.056	)
(	13	1.3601	0.06789	)
(	14	1.3591	0.08145	)
(	15	1.3395	0.09866	)
(	16	1.3075	0.11872	)
(	17	1.2693	0.14392	)
(	18	1.209	0.18289	)
(	19	1.1382	0.23794	)
(	20	1.112	0.27947	)
(	21	1.0869	0.31169	)
(	22	0.952	0.30737	)
(	23	0.918	0.31507	)
(	24	0.9026	0.322	)
(	25	0.8917	0.32944	)
(	30	0.8663	0.36594	)
(	35	0.8529	0.40217	)
(	40	0.8282	0.43727	)
(	45	0.7952	0.47227	)
(	50	0.7476	0.50468	)

//OLD stuff
(	55	1.60097269	2.320797107	)
(	60	1.418212498	2.450651302	)
(	65	1.240684494	2.595659402	)
(	70	1.039209894	2.722961427	)
(	75	0.838773462	2.906541755	)
(	80	0.598364995	2.952011765	)
(	85	0.358578033	3.137988235	)
(	90	0.090599634	3.337229315	)
(	95	-0.150555823	2.936015815	)
(	100	-0.448594735	3.194177435	)
(	105	-0.742829431	3.259712247	)
(	110	-0.978080791	3.062044166	)
(	115	-1.164313095	2.806026422	)
(	120	-1.327900386	2.563311475	)
(	125	-1.467913462	2.324761813	)
(	130	-1.502751148	1.991975892	)
(	135	-1.527525882	1.699897281	)
(	140	-1.557622122	1.459593616	)
(	145	-1.47193379	1.159616991	)
(	150	-1.45242162	0.947607425	)
(	155	-1.298914966	0.6945135	)
(	160	-1.364641099	0.535981485	)
(	165	-1.426565072	0.35643946	)
(	170	-0.973898245	0.198538573	)
(	175	-0.442199653	0.130726854	)
(	180	0.058547898	0.139764517	)

);
