tutorials/turbine/KrogstadWindTunnelCase/0.original/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            slip;
    }

    ground
    {
        type            slip;
    }

    walls
    {
        type            slip;
    }

    outflow
    {
        type            calculated;
        value           uniform 0;
//        type            zeroGradient;
    }

    inflow
    {
        type            calculated;
        value           uniform 0;
//        type            zeroGradient;
    }
}


// ************************************************************************* //
