tutorials/turbine/KrogstadWindTunnelCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-05;
            relTol          0.01;
            smoother        DICGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 100;
            agglomerator    faceAreaPair;
            mergeLevels     2;
        }
        tolerance       1e-06;
        relTol           0.01;
        maxIter         1000;
    }

    pFinal
    {
        $p;
        relTol 0.0;
    }

    "(U|T|k|epsilon|R)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
        maxIter         1000;
    }

    "(U|T|k|epsilon|R)Final"
    {
        $U;
        relTol          0.0;
    }

    "(flm|fmm)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(flm|fmm)Final"
    {
        $flm;
        relTol          0.0;
    }

}

PISO
{
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;

    pRefPoint          (0.0 -3.65 0.0);
    pRefValue           0;
}

// ************************************************************************* //
